app/Controllers/Auth.php

SELECT `id`, `name`, `role_id`, `skpd_id`, `is_active`
FROM `user`
WHERE `username` = 'superadmin'
AND `password` = '6079cca0923e90ff1eb3c45dd0391385'
INSERT INTO `log` (`user_id`, `activity`, `ip`) VALUES ('1', 'login', '::1')
---
    public function user($tp, $dx=0)
    {
        helper('url');
        $session = \Config\Services::session();

        switch($tp){
            case 'login':
                $uname = strip_tags($this->request->getPost('uname'));
                $ifpsd = strip_tags($this->request->getPost('pswd'));

                if($uname && $ifpsd){
                    $db = \Config\Database::connect();
                    $builder = $db->table('user');
                    $builder->select("id, name, role_id, skpd_id, is_active");
                    $builder->where("username", $uname);
                    $builder->where("password", $this->ifunction->pswd($ifpsd));
                    $Qcheck = $builder->get();

                    if($Qcheck->getNumRows()){
                        $check = $Qcheck->getResult();
                        if($check[0]->is_active == 1){

                            $session->set('sabilulungan', [
                                'uid' => $check[0]->id,
                                'name' => $check[0]->name,
                                'role' => $check[0]->role_id,
                                'skpd' => $check[0]->skpd_id,
                                'base_url' => base_url()
                            ]);

                            $db->table('log')->insert(['user_id' => $check[0]->id, 'activity' => 'login', 'ip' => $this->request->getIPAddress()]);