app/Controllers/HasLogin.php

SELECT `proposal`.`id`, `proposal`.`name`, `proposal`.`address`, `proposal`.`judul`, `proposal`.`current_stat`, `proposal`.`nphd`, `proposal`.`tanggal_lpj`, `proposal_checklist`.`value`
FROM `proposal`
JOIN `proposal_checklist` ON `proposal`.`id` = `proposal_checklist`.`proposal_id`
WHERE `proposal_checklist`.`checklist_id` = 28
ORDER BY `proposal`.`id` DESC
 LIMIT 15
---
    public function tapd_report($p=0, $dx=0)
	{

        $session = \Config\Services::session();
        $limit = 15;
        $p = $p ? $p : 1;
        $position = ($p -1) * $limit;
        $this->db->_protect_identifiers=false;
        if(isset($_POST['search'])){
            //Query Search
            $builder = $this->db->table('proposal');
            $builder->select("proposal.id, proposal.name, proposal.address, proposal.judul, proposal.current_stat, proposal.nphd, proposal.tanggal_lpj, proposal_checklist.value,(SELECT SUM(amount) FROM proposal_dana WHERE proposal_dana.proposal_id = proposal.id) as total_amount");
            $builder->join('proposal_checklist', 'proposal.id = proposal_checklist.proposal_id');
            $builder->where('proposal_checklist.checklist_id', 28);
            $builder->like('proposal.name', $_POST['keyword']);
            $builder->orderBy('proposal.id', 'DESC');
            $builder->limit($limit, $position);
            $Qlist = $builder->get()->getResult();