app/Controllers/Main.php

	public function infografis(){
		//total proposaltahun ini
		$totalProposal = $this->db->table('proposal')
			->where('YEAR(time_entry)', date('Y'))
			->countAllResults();
		$proposalData = $this->db->table('proposal')
				->join('proposal_approval', 'proposal.id = proposal_approval.proposal_id')
				->where('proposal_approval.flow_id >', 3)
				->select('proposal.judul, proposal.id,proposal.name')
				->get()
				->getResult();
		$proposalDataTahunIni = $this->db->table('proposal')
					->join('proposal_approval', 'proposal.id = proposal_approval.proposal_id')
					->where('proposal_approval.flow_id >', 6)
					->where('YEAR(proposal.time_entry)', date('Y'))
					->select('proposal.judul, proposal.id,proposal.name')
					->get()
					->getResult();
		$totalproposalstep1 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('(current_stat = 1 OR current_stat IS NULL)')
					->countAllResults();

		$totalproposalstep2 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 2)
					->countAllResults();
		$totalproposalstep3 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 3)
					->countAllResults();
		$totalproposalstep4 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 4)
					->countAllResults();
		$totalproposalstep5 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 5)
					->countAllResults();
		$totalproposalstep6 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 6)
					->countAllResults();
		$totalproposalstep7 = $this->db->table('proposal')
					->where('YEAR(time_entry)', date('Y'))
					->where('current_stat', 7)
					->countAllResults();
		$skpd = $this->db->table('skpd')
					->select('skpd.name, skpd.id')
					->get()
					->getResult();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
SELECT `proposal`.`judul`, `proposal`.`id`, `proposal`.`name`
FROM `proposal`
JOIN `proposal_approval` ON `proposal`.`id` = `proposal_approval`.`proposal_id`
WHERE `proposal_approval`.`flow_id` > 3
SELECT `proposal`.`judul`, `proposal`.`id`, `proposal`.`name`
FROM `proposal`
JOIN `proposal_approval` ON `proposal`.`id` = `proposal_approval`.`proposal_id`
WHERE `proposal_approval`.`flow_id` > 6
AND YEAR(proposal.time_entry) = '2024'
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND (`current_stat` = 1 OR `current_stat` IS NULL)
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 2
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 3
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 4
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 5
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 6
SELECT COUNT(*) AS `numrows`
FROM `proposal`
WHERE YEAR(time_entry) = '2024'
AND `current_stat` = 7
SELECT `skpd`.`name`, `skpd`.`id`
FROM `skpd`

						"#e74c3c", "#2ecc71", "#f1c40f", "#e67e22"
					);

			$skpds = $this->db->table('skpd')
				->select('skpd.name, skpd.id')
				->get()
				->getResult();
---
SELECT `skpd`.`name`, `skpd`.`id`
FROM `skpd`

			}else{
				$persen = 0;
			}
			$flows = $this->db->table('flow')
			->select('flow.name, flow.id')
			->get()
			->getResult();
---
SELECT `flow`.`name`, `flow`.`id`
FROM `flow`

				->where('YEAR(proposal.time_entry)', date('Y'))
				->countAllResults();
			}else{
				$totalProposalFlow = $this->db->table('proposal')
				->join('proposal_approval', 'proposal.id = proposal_approval.proposal_id')
				->where('proposal.current_stat', $row->id)
				->where('YEAR(proposal.time_entry)', date('Y'))
				->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal`
JOIN `proposal_approval` ON `proposal`.`id` = `proposal_approval`.`proposal_id`
WHERE (`current_stat` = 1 OR `current_stat` IS NULL)
AND YEAR(proposal.time_entry) = '2024'