app/Controllers/Pdf.php

INSERT INTO `log` (`user_id`, `activity`, `ip`) VALUES ('38', 'generate_dnc', '::1')
---
	public function generate_dnc($kategori=0, $dari='', $sampai='', $skpd=0)
	{

        //ubah ke format 2023-11-23

        // Ubah $dari menjadi awal tahun
        $dateStart = new DateTime();
        $dateStart->setDate($dari, 1, 1); // Set the date to January 1 of $dari
        $dari = $dateStart->format('Y-m-d'); // Format the date

        // Ubah $sampai menjadi akhir tahun
        $dateEnd = new DateTime();
        $dateEnd->setDate($sampai, 12, 31); // Set the date to December 31 of $sampai
        $sampai = $dateEnd->format('Y-m-d'); // Format the date

		// if($dari!='' && $sampai!='' && $skpd!=0){
		// 	// $Qskpd = $this->db->query("SELECT name FROM skpd WHERE id='$skpd'");
		// 	// $skpd = $Qskpd->result_object(); $name = $skpd[0]->name;
		// 	$tgl_dari = date('d/M/Y', strtotime($dari)); $tgl_sampai = date('d/M/Y', strtotime($sampai));

		// 	// $filename = 'DNC-PBH-'.$name.' - '.$tgl_dari.'-'.$tgl_sampai;
		// 	$filename = 'DNC-PBH-'.$tgl_dari.'-'.$tgl_sampai;
		// }else $filename = 'DNC-PBH-'.date('d/M/Y');

		$session = \Config\Services::session();
		$request = \Config\Services::request();

		$this->db->table('log')->insert([
			'user_id' => $session->get('sabilulungan')['uid'],
			'activity' => 'generate_dnc',
			'ip' => $request->getIPAddress()
		]);

SELECT `id`, `name`, `address`, `maksud_tujuan`
FROM `proposal`
WHERE `time_entry` >= '2024-01-01'
AND `time_entry` <= '2024-12-31'
AND `skpd_id` = 'all'
ORDER BY `id` DESC
---
                <tbody>
                    <?php
                    if ($dari != '' && $sampai != '' && $skpd != 0) {
                        $Qlist = $this->db->table('proposal') // Use the table() method instead of select()
                            ->select("id, name, address, maksud_tujuan")
                            ->where('time_entry >=', $dari)
                            ->where('time_entry <=', $sampai)
                            ->where('skpd_id', $skpd)
                            ->orderBy('id', 'DESC')
                            ->get();