app/Controllers/Process.php

UPDATE `proposal` SET `nphd` = '2023-2024-Tugas 1-PBM1.pdf'
WHERE `id` = '17'
---
					return redirect()->back();
				}

				$db->table('proposal')->update(['nphd' => $new_file_name], ['id' => $dx]);

INSERT INTO `proposal_photo` (`proposal_id`, `sequence`, `path`, `is_nphd`) VALUES ('17', 2, 'flow.png', 1)
---
									return redirect()->back();
								}

								$db->table('proposal_photo')->insert(['proposal_id' => $dx, 'sequence' => $i, 'path' => $new_file_name, 'is_nphd' => 1]);

UPDATE `proposal_dana` SET `correction` = ''
WHERE `proposal_id` = '17'
AND `sequence` = 1
---
				if($koreksi){
					$i = 1;
					foreach($koreksi as $index => $value) {
						$db->table('proposal_dana')->update(['correction' => $value], ['proposal_id' => $dx, 'sequence' => $i]);

INSERT INTO `log` (`user_id`, `activity`, `id`, `ip`) VALUES ('1', 'add_nphd', '17', '::1')
---
					}
				}

				$db->table('log')->insert(['user_id' => $session->get('sabilulungan')['uid'], 'activity' => 'add_nphd', 'id' => $dx, 'ip' => $this->request->getIPAddress()]);

UPDATE `proposal` SET `tanggal_lpj` = '2023-11-08'
WHERE `id` = '17'
---
			if($user_id && $role_id && $tanggal){
				$files = $this->request->getFiles();

				$db->table('proposal')->update(['tanggal_lpj' => $tanggal], ['id' => $dx]);

INSERT INTO `proposal_lpj` (`proposal_id`, `sequence`, `path`, `type`) VALUES ('17', 1, 'flow_12.png', 1)
---
									return redirect()->back();
								}

								$db->table('proposal_lpj')->insert(['proposal_id' => $dx, 'sequence' => $i, 'path' => $new_file_name, 'type' => 1]);

INSERT INTO `proposal_lpj` (`proposal_id`, `sequence`, `path`, `type`) VALUES ('17', 2, 'http://www.youtube.com/embed/uuO7e4Qg8vY?autoplay=1', 2)
---
						$id = $matches[1];
						$url = 'http://www.youtube.com/embed/'.$id.'?autoplay=1';

						$db->table('proposal_lpj')->insert(['proposal_id' => $dx, 'sequence' => $j, 'path' => $url, 'type' => 2]);

INSERT INTO `log` (`user_id`, `activity`, `id`, `ip`) VALUES ('1', 'add_lpj', '17', '::1')
---
					}
				}

				$db->table('log')->insert(['user_id' => $session->get('sabilulungan')['uid'], 'activity' => 'add_lpj', 'id' => $dx, 'ip' => $this->request->getIPAddress()]);