app/Controllers/Process.php

UPDATE `user` SET `name` = 'Fery Andriani', `email` = 'veridetta@gmail.com', `address` = 'Plumbon', `phone` = '+628817769047', `ktp` = '33243365565665', `username` = 'veridetta', `is_active` = '1'
WHERE `id` = '42'
INSERT INTO `log` (`user_id`, `activity`, `id`, `ip`) VALUES ('1', 'edit_umum', '42', '::1')
---
						return redirect()->back();
					}
				}else{
					$db->table('user')->update($data, ['id' => $dx]);

					$db->table('log')->insert(['user_id' => $session->get('sabilulungan')['uid'], 'activity' => 'edit_umum', 'id' => $dx, 'ip' => $request->getIPAddress()]);