app/Views/content/detail.php

            <ul class="category-list list-nostyle">
                <?php
                $builder = $db->table('proposal');
                $Qtahun = $builder->select("YEAR(`time_entry`) AS tahun")->groupBy("YEAR(`time_entry`)")->orderBy("YEAR(`time_entry`)", "ASC")->get();
---
SELECT YEAR(`time_entry`) AS tahun
FROM `proposal`
GROUP BY YEAR(`time_entry`)
ORDER BY YEAR(`time_entry`) ASC