app/Views/content/report.php

                        }

                        if($list->current_stat==0 && $_SESSION['sabilulungan']['role']==5 || $list->current_stat==0 && $_SESSION['sabilulungan']['role']==7 || $list->current_stat==0 && $_SESSION['sabilulungan']['role']==9){
                            $approvalExists = $db->table('proposal_approval')
                                        ->where('flow_id', $list->current_stat+1)
                                        ->where('action', 2)
                                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal_approval`
WHERE `flow_id` = 1
AND `action` = 2

                                    echo '<td style="text-align:center">'.$status.'</td>';
                                }
                            }
                            $approvalExists = $db->table('proposal_approval')
                                        ->where('flow_id', $list->current_stat+1)
                                        ->where('action', 2)
                                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal_approval`
WHERE `flow_id` = 2
AND `action` = 2

                                    echo '<td style="text-align:center">'.$status.'</td>';
                                }
                            }
                            $approvalExists = $db->table('proposal_approval')
                                        ->where('flow_id', $list->current_stat+1)
                                        ->where('action', 2)
                                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal_approval`
WHERE `flow_id` = 3
AND `action` = 2

                                    echo '<td style="text-align:center">'.$status.'</td>';
                                }
                            }
                            $approvalExists = $db->table('proposal_approval')
                                        ->where('flow_id', $list->current_stat+1)
                                        ->where('action', 2)
                                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `proposal_approval`
WHERE `flow_id` = 4
AND `action` = 2