app/Views/content/tapd.php

SELECT `id`, `name`
FROM `proposal_type`
ORDER BY `id` ASC
---
                <select name="kategori">
                <!-- <option value="0">-- Silahkan Pilih</option> -->
                <?php
                $Qkategori = $db->table('proposal_type')->select("id, name")->order_by('id', 'ASC')->get();